_data/phive/modules/Test/TestAmatic/authorizePlayer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:aut="http://authorization.wallet.integration.eoc.edict.de">
   <soapenv:Header/>
   <soapenv:Body>
      <aut:authorizePlayer>
         <authorizationRequest>
            <callerId>{{callerId}}</callerId>
            <callerPassword>{{callerPassword}}</callerPassword>
            <playerName>{{playerName}}</playerName>
            <sessionToken>{{sessionToken}}</sessionToken>
         </authorizationRequest>
      </aut:authorizePlayer>
   </soapenv:Body>
</soapenv:Envelope>
